; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v2 ?v6)
             (pred_5 ?v13 ?v3)
             (pred_7 ?v2 ?v3)
             (pred_2 ?v12 ?v2 )
	     (pred_9 ?v2)
             (pred_1 ?v11)
             (pred_11 ?v13)
             (pred_10 ?v3)
             (pred_4 ?v2)
             (pred_3 ?v13)
             (pred_12 ?v2)
             (pred_8 ))



(:action op_1
:parameters (?v7 ?v10 ?v4 ?v9)
:precondition (and (pred_1 ?v7) (pred_1 ?v10) (pred_11 ?v4) (pred_10 ?v9)
          (pred_6 ?v7 ?v10) (pred_5 ?v4 ?v9)
                   (pred_7 ?v10 ?v9) (pred_9 ?v7) 
                   (pred_4 ?v10) (pred_3 ?v4))
:effect (and  (pred_12 ?v10) (not (pred_4 ?v10))))


(:action op_5
:parameters (?v7 ?v5)
:precondition (and (pred_1 ?v7) (pred_1 ?v5)
               (pred_9 ?v7) (pred_6 ?v7 ?v5) (pred_12 ?v5))
:effect (and (pred_9 ?v5) (not (pred_9 ?v7))))

(:action op_4
:parameters (?v7 ?v4)
:precondition (and (pred_1 ?v7) (pred_11 ?v4) 
                  (pred_9 ?v7) (pred_2 ?v4 ?v7) (pred_8 ))
:effect (and (pred_3 ?v4)
   (not (pred_2 ?v4 ?v7)) (not (pred_8 ))))


(:action op_2
:parameters (?v7 ?v1 ?v8)
:precondition (and (pred_1 ?v7) (pred_11 ?v1) (pred_11 ?v8)
                  (pred_9 ?v7) (pred_3 ?v8) (pred_2 ?v1 ?v7))
:effect (and (pred_3 ?v1) (pred_2 ?v8 ?v7)
        (not (pred_3 ?v8)) (not (pred_2 ?v1 ?v7))))

(:action op_3
:parameters (?v7 ?v4)
:precondition (and (pred_1 ?v7) (pred_11 ?v4) 
                  (pred_9 ?v7) (pred_3 ?v4))
:effect (and (pred_8 ) (pred_2 ?v4 ?v7) (not (pred_3 ?v4)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_26 obj_15 obj_06 obj_08 obj_03 obj_18 obj_28 obj_22 obj_17 obj_05 obj_21 obj_04 obj_24 obj_07 obj_12 obj_16 obj_30 obj_14 obj_02 obj_25 obj_27 obj_11 obj_20 obj_10
    obj_13 obj_19
    obj_01 obj_29 obj_09
    )

    (:init
       (pred_8)

       (pred_1 obj_23)
       (pred_1 obj_26)
       (pred_1 obj_15)
       (pred_1 obj_06)
       (pred_1 obj_08)
       (pred_1 obj_03)
       (pred_1 obj_18)
       (pred_1 obj_28)
       (pred_1 obj_22)
       (pred_1 obj_17)
       (pred_1 obj_05)
       (pred_1 obj_21)
       (pred_1 obj_04)
       (pred_1 obj_24)
       (pred_1 obj_07)
       (pred_1 obj_12)
       (pred_1 obj_16)
       (pred_1 obj_30)
       (pred_1 obj_14)
       (pred_1 obj_02)
       (pred_1 obj_25)
       (pred_1 obj_27)
       (pred_1 obj_11)
       (pred_1 obj_20)
       (pred_1 obj_10)
       (pred_10 obj_13)
       (pred_10 obj_19)
       (pred_11 obj_01)
       (pred_11 obj_29)
       (pred_11 obj_09)

       (pred_6 obj_23 obj_03)
       (pred_6 obj_23 obj_26)
       (pred_6 obj_26 obj_18)
       (pred_6 obj_26 obj_15)
       (pred_6 obj_26 obj_23)
       (pred_6 obj_15 obj_28)
       (pred_6 obj_15 obj_06)
       (pred_6 obj_15 obj_26)
       (pred_6 obj_06 obj_22)
       (pred_6 obj_06 obj_08)
       (pred_6 obj_06 obj_15)
       (pred_6 obj_08 obj_17)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_03 obj_05)
       (pred_6 obj_03 obj_18)
       (pred_6 obj_03 obj_23)
       (pred_6 obj_18 obj_21)
       (pred_6 obj_18 obj_28)
       (pred_6 obj_18 obj_26)
       (pred_6 obj_18 obj_03)
       (pred_6 obj_28 obj_04)
       (pred_6 obj_28 obj_22)
       (pred_6 obj_28 obj_15)
       (pred_6 obj_28 obj_18)
       (pred_6 obj_22 obj_24)
       (pred_6 obj_22 obj_17)
       (pred_6 obj_22 obj_06)
       (pred_6 obj_22 obj_28)
       (pred_6 obj_17 obj_07)
       (pred_6 obj_17 obj_08)
       (pred_6 obj_17 obj_22)
       (pred_6 obj_05 obj_12)
       (pred_6 obj_05 obj_21)
       (pred_6 obj_05 obj_03)
       (pred_6 obj_21 obj_16)
       (pred_6 obj_21 obj_04)
       (pred_6 obj_21 obj_18)
       (pred_6 obj_21 obj_05)
       (pred_6 obj_04 obj_30)
       (pred_6 obj_04 obj_24)
       (pred_6 obj_04 obj_28)
       (pred_6 obj_04 obj_21)
       (pred_6 obj_24 obj_14)
       (pred_6 obj_24 obj_07)
       (pred_6 obj_24 obj_22)
       (pred_6 obj_24 obj_04)
       (pred_6 obj_07 obj_02)
       (pred_6 obj_07 obj_17)
       (pred_6 obj_07 obj_24)
       (pred_6 obj_12 obj_25)
       (pred_6 obj_12 obj_16)
       (pred_6 obj_12 obj_05)
       (pred_6 obj_16 obj_27)
       (pred_6 obj_16 obj_30)
       (pred_6 obj_16 obj_21)
       (pred_6 obj_16 obj_12)
       (pred_6 obj_30 obj_11)
       (pred_6 obj_30 obj_14)
       (pred_6 obj_30 obj_04)
       (pred_6 obj_30 obj_16)
       (pred_6 obj_14 obj_20)
       (pred_6 obj_14 obj_02)
       (pred_6 obj_14 obj_24)
       (pred_6 obj_14 obj_30)
       (pred_6 obj_02 obj_10)
       (pred_6 obj_02 obj_07)
       (pred_6 obj_02 obj_14)
       (pred_6 obj_25 obj_27)
       (pred_6 obj_25 obj_12)
       (pred_6 obj_27 obj_11)
       (pred_6 obj_27 obj_16)
       (pred_6 obj_27 obj_25)
       (pred_6 obj_11 obj_20)
       (pred_6 obj_11 obj_30)
       (pred_6 obj_11 obj_27)
       (pred_6 obj_20 obj_10)
       (pred_6 obj_20 obj_14)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_10 obj_02)
       (pred_6 obj_10 obj_20)
       (pred_4 obj_10)
       (pred_4 obj_30)
       (pred_4 obj_11)
       (pred_7  obj_10 obj_13)
       (pred_7  obj_30 obj_19)
       (pred_7  obj_11 obj_19)
       (pred_12 obj_23)
       (pred_12 obj_26)
       (pred_12 obj_15)
       (pred_12 obj_06)
       (pred_12 obj_08)
       (pred_12 obj_03)
       (pred_12 obj_18)
       (pred_12 obj_28)
       (pred_12 obj_22)
       (pred_12 obj_17)
       (pred_12 obj_05)
       (pred_12 obj_21)
       (pred_12 obj_04)
       (pred_12 obj_24)
       (pred_12 obj_07)
       (pred_12 obj_12)
       (pred_12 obj_16)
       (pred_12 obj_14)
       (pred_12 obj_02)
       (pred_12 obj_25)
       (pred_12 obj_27)
       (pred_12 obj_20)

       (pred_5  obj_01 obj_13)
       (pred_5  obj_29 obj_19)
       (pred_5  obj_09 obj_19)
       (pred_2 obj_01 obj_07)
       (pred_2 obj_29 obj_15)
       (pred_2 obj_09 obj_05)
       (pred_9 obj_14)
    )

    (:goal (and
       (pred_2 obj_29 obj_21)
       (pred_2 obj_09 obj_07)
    ))
(:constraints
  (always (not (pred_9 obj_04)))
)
)

; plan
1. (op_5 obj_14 obj_24)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_24)
   goals met: 0 of 2
2. (op_5 obj_24 obj_22)
   deleted: (pred_9 obj_24)
   added: (pred_9 obj_22)
   goals met: 0 of 2
3. (op_5 obj_22 obj_28)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_28)
   goals met: 0 of 2
4. (op_5 obj_28 obj_18)
   deleted: (pred_9 obj_28)
   added: (pred_9 obj_18)
   goals met: 0 of 2
5. (op_5 obj_18 obj_21)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_21)
   goals met: 0 of 2
6. (op_5 obj_21 obj_05)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_05)
   goals met: 0 of 2
7. (op_4 obj_05 obj_09)
   deleted: (pred_2 obj_09 obj_05) (pred_8)
   added: (pred_3 obj_09)
   goals met: 0 of 2
8. (op_5 obj_05 obj_21)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_21)
   goals met: 0 of 2
9. (op_3 obj_21 obj_09)
   deleted: (pred_3 obj_09)
   added: (pred_8) (pred_2 obj_09 obj_21)
   goals met: 0 of 2
10. (op_5 obj_21 obj_18)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_18)
   goals met: 0 of 2
11. (op_5 obj_18 obj_28)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_28)
   goals met: 0 of 2
12. (op_5 obj_28 obj_15)
   deleted: (pred_9 obj_28)
   added: (pred_9 obj_15)
   goals met: 0 of 2
13. (op_4 obj_15 obj_29)
   deleted: (pred_2 obj_29 obj_15) (pred_8)
   added: (pred_3 obj_29)
   goals met: 0 of 2
14. (op_5 obj_15 obj_28)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_28)
   goals met: 0 of 2
15. (op_5 obj_28 obj_18)
   deleted: (pred_9 obj_28)
   added: (pred_9 obj_18)
   goals met: 0 of 2
16. (op_5 obj_18 obj_21)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_21)
   goals met: 0 of 2
17. (op_2 obj_21 obj_09 obj_29)
   deleted: (pred_3 obj_29) (pred_2 obj_09 obj_21)
   added: (pred_3 obj_09) (pred_2 obj_29 obj_21)
   goals met: 1 of 2
18. (op_5 obj_21 obj_18)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_18)
   goals met: 1 of 2
19. (op_5 obj_18 obj_28)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_28)
   goals met: 1 of 2
20. (op_5 obj_28 obj_22)
   deleted: (pred_9 obj_28)
   added: (pred_9 obj_22)
   goals met: 1 of 2
21. (op_5 obj_22 obj_17)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_17)
   goals met: 1 of 2
22. (op_5 obj_17 obj_07)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_07)
   goals met: 1 of 2
23. (op_2 obj_07 obj_01 obj_09)
   deleted: (pred_3 obj_09) (pred_2 obj_01 obj_07)
   added: (pred_3 obj_01) (pred_2 obj_09 obj_07)
   goals met: 2 of 2
